package Rekurs;

class RecTest {
    int values[];
    RecTest(int i){
        values = new int[i];
    }
    // вывод рекурсивно элем массива
    void printArray(int i){
        if (i==0) return;
        else printArray(i-1);
        System.out.print("[" +(i-1)+ "]" +values[i-1]+ " ");
    }
}
class Recursion2 {
    public static void main(String[] args) {
        RecTest ob = new RecTest(10);
        int i;

        for (i = 0; i < 10; i++) {
            ob.values[i] = i;
            ob.printArray(10);
        }
    }
}/*
            [0]0 [1]0 [2]0 [3]0 [4]0 [5]0 [6]0 [7]0 [8]0 [9]0
            [0]0 [1]1 [2]0 [3]0 [4]0 [5]0 [6]0 [7]0 [8]0 [9]0
            [0]0 [1]1 [2]2 [3]0 [4]0 [5]0 [6]0 [7]0 [8]0 [9]0
            [0]0 [1]1 [2]2 [3]3 [4]0 [5]0 [6]0 [7]0 [8]0 [9]0
            [0]0 [1]1 [2]2 [3]3 [4]4 [5]0 [6]0 [7]0 [8]0 [9]0
            [0]0 [1]1 [2]2 [3]3 [4]4 [5]5 [6]0 [7]0 [8]0 [9]0
            [0]0 [1]1 [2]2 [3]3 [4]4 [5]5 [6]6 [7]0 [8]0 [9]0
            [0]0 [1]1 [2]2 [3]3 [4]4 [5]5 [6]6 [7]7 [8]0 [9]0
            [0]0 [1]1 [2]2 [3]3 [4]4 [5]5 [6]6 [7]7 [8]8 [9]0
            [0]0 [1]1 [2]2 [3]3 [4]4 [5]5 [6]6 [7]7 [8]8 [9]9
*/

